<unk>
<s>
</s>
<UNK>
1644
164252
2661
4718
487
1492
3055
1795
2044
2754
2682
16043
126
8744
2258
98214
681
2885
584
2074
65656
1198
2878
2764
1973
2
32
2712
2998
2513
2480
2818
1873
1995
309
8640
3017
211
3637
8706
3412
533
944
2932
86403
3050
119595
2854
2590
930
2446
3101
340
339
3065
2648
2524
2373
1396
15737
3024
2234
2658
2474
2704
2058
147
1197
3054
1925
2596
78484
2470
2541
2072
86212
8700
127468
1869
1910
2933
2868
1277
8698
472
150434
1203
75966
36659
2556
7
3022
1334
92110
2542
2289
2813
1014
130588
2620
2141
2839
1783
143
8817
2089
8631
838
8672
3007
874
2552
8626
2568
1429
306
1866
112078
2785
1002
1865
1976
96
2956
114671
67972
76119
1207
2755
2570
2447
2170
102402
2936
3200
3935
1679
1690
16015
1966
61021
650
43993
524
8661
2673
1026
2645
290
2984
2496
98495
764
127861
2493
37455
2532
136996
2947
402
51
2808
2647
2802
1109
3215
45186
2344
2905
8653
2973
61945
2424
1237
1669
2416
2670
1584
37195
2206
1154
2765
88115
13042
2339
666
2750
983
2726
26
2116
1187
1797
34082
2518
443
93203
1590
2828
120
4221
702
2227
1684
249
2592
2530
506
2743
696
139182
2476
2579
2762
2535
2634
1075
2875
2920
2085
1834
139879
195
1007
2733
167
45006
2479
2028
8782
2600
8703
2950
2686
729
8682
1698
2730
2979
8650
15986
45971
145269
1306
19085
2914
988
449
2763
2834
31670
17166
8760
543
962
2462
2651
61
463
2539
2533
2836
34945
181
1113
2562
2631
2454
16133
2732
2845
2452
10
4
918
362
150554
2993
97746
3094
3085
2916
51530
7870
2797
197
2066
2749
2892
2567
2822
8657
1943
395
78691
2650
2464
226
15999
3069
891
2613
126300
2594
2427
42612
57480
2079
2426
2816
2991
95128
2564
3120
785
445
2666
38
2887
498
2259
2675
1687
2943
1241
2394
1777
3097
186
8625
1870
2243
2908
377
2599
2922
1864
2766
82187
8765
3053
134352
1929
1333
119121
8699
1765
154774
130017
2425
2824
2548
10506
98620
2803
122273
2699
68042
50532
2640
2584
54674
3092
2772
2677
2709
2853
66555
2607
2930
2216
156233
6964
125440
2921
2624
79519
2990
31805
2468
416
2789
2506
4730
352
3081
1222
60466
2807
2042
803
43379
2561
2538
2408
8638
30487
178
2413
3216
351
59585
2101
2938
2883
3501
2589
3019
1911
38210
62098
986
3062
542
1288
2128
13
4941
435
452
3118
210
57507
128583
59395
6131
2833
2796
8632
2768
148
2923
3005
8762
58564
2459
2895
2760
1275
2505
338
2563
8642
16420
2603
2787
138588
2483
8755
3073
5872
82312
1202
2559
855
2697
2804
2847
97482
2455
3014
1686
956
2860
2433
878
446
3045
8779
2861
2419
4738
2543
535
79903
2043
47692
2615
1764
122811
752
109711
3001
2904
2964
3624
2774
2761
2551
2987
2889
2835
2872
2719
8756
119908
3108
19821
1071
686
63319
1878
110811
2653
7928
3061
3011
3071
8660
2837
28609
2077
60965
129594
69481
2994
2490
3049
2958
2911
1794
8665
8628
2573
8686
1488
134358
2228
7940
2517
189
2516
1788
35611
1892
97464
1094
12274
72845
354
79803
76233
8714
634
2692
2826
1420
2662
95346
333
3625
1132
1098
2820
2549
2484
150642
246
2741
458
1604
2045
73989
2436
3100
2432
28685
3040
100313
135429
2676
2611
2852
11948
1496
2827
2360
8627
2728
16126
2788
2034
2546
3044
2814
2840
42245
2442
1863
128019
2792
13860
35515
3032
2443
136437
3013
96703
8684
3095
3089
92664
559
2744
155736
130818
3015
139093
568
997
1045
8630
199
2738
28697
2898
2865
7676
73863
157331
2880
281
8639
2090
54157
44496
15998
98831
2784
2842
1397
2886
3016
4113
2604
2939
2794
145218
698
2821
739
2783
8636
1608
1232
8713
137059
2782
3063
121987
2864
1563
153256
2831
714
33655
41201
2941
2992
1912
144847
2899
2581
2491
3048
2657
1821
2654
2859
54117
392
112207
42595
2773
163402
1226
2751
9184
2083
57168
9707
3469
2379
2097
2713
2942
206
1169
2509
2718
11686
152
2759
1058
14641
93512
75775
2988
1786
2575
8708
19198
1152
444
4610
8692
2485
169
1240
65588
2684
2945
3003
78409
2529
3008
3105
106
2458
3300
76885
2823
150690
101809
2798
36213
2571
135097
37564
135870
102834
70360
71028
587
2871
3190
474
95424
2619
32323
906
16205
4912
2105
2608
7903
96094
834
153717
2660
14902
2975
2867
77598
2953
22649
128
2944
1278
2702
532
1005
108187
2758
1872
2219
8770
2526
8739
122
50408
1468
8799
40071
54868
4431
2481
8746
2978
82447
8696
78907
8426
60113
137743
2800
9305
123367
1161
131726
2688
2071
25593
152047
1489
156472
2450
2901
1313
12072
135319
2786
164152
8633
142868
2919
40667
63106
140895
1801
150265
578
136291
2671
46075
105675
1710
1940
10966
2940
2935
70135
59935
113727
135392
75914
134236
2194
2770
149091
2366
120276
152268
8759
2020
42
8752
87305
146467
2569
16042
8693
91129
37303
2757
2925
3123
4832
3068
85390
2790
6451
1271
106895
18
54383
2367
98
45263
8783
2467
2841
155379
2508
124074
1634
36779
2830
2959
8691
2902
2683
16
2917
3038
74681
2487
16025
2431
33327
5673
57602
54218
2927
139826
61828
2848
14102
138684
8658
4654
2689
2747
2418
66305
15488
1566
2510
3082
142386
16053
4626
2330
2477
15894
8797
2177
112479
2669
134356
38619
2527
46034
11884
736
1229
2492
6923
159075
58878
8651
2031
3088
3087
18228
8822
2284
61232
79551
7341
2888
1826
2857
73400
2523
3115
2488
2070
2099
1432
89971
97961
2832
2498
2463
125385
604
38548
8761
1201
51149
2977
91
60650
9803
2086
100423
2976
3584
11521
93626
2809
53509
155407
2636
99957
1874
115043
25018
70943
85365
92732
2934
2929
3057
2799
52787
156024
2954
8663
16083
76231
433
2646
16158
294
8789
159
6257
711
82656
29969
81060
4242
56705
45168
142139
137667
2652
164
8680
2734
72927
102526
8629
3052
475
40522
155441
54977
2495
2461
152299
2520
9025
164033
3067
4637
8816
2679
125062
115252
8758
2423
3077
2795
98648
847
163000
2729
2422
48411
141
78349
57996
2489
48368
90439
2963
8701
42126
48381
121996
32559
8637
147956
120232
2753
32260
1891
29391
125849
33946
399
94688
7117
95036
113692
119746
3106
43729
152627
8815
105590
2907
2087
93195
52544
2644
518
87463
8742
2829
76949
131031
8707
2048
42297
2168
2440
49404
545
2778
141464
3119
2812
104274
8710
1785
79239
30063
35284
80730
16019
1039
16136
14857
148310
113
97081
2421
8644
50590
5150
3031
37463
8645
103280
2873
2955
616
144012
77
36068
2946
92389
77159
3964
16002
111
49600
8743
2621
87
88518
75768
2439
137292
325
21393
1441
112662
14422
2696
39767
447
42190
139819
2695
113205
34436
58850
29948
95276
6313
2846
14373
8
8649
1443
2415
115421
105927
2745
76254
50989
2663
51505
6931
4814
54657
122693
11328
2536
2656
3091
31325
2565
125338
55355
58016
2706
7985
144390
135437
13218
63309
140041
2409
6355
163196
98070
102
13093
1382
29695
12433
37064
66737
3034
27802
819
40054
1896
133460
6334
19596
14655
2849
1638
24088
2825
2482
5597
111059
70976
16129
3083
2632
94770
45086
1204
44992
8646
2617
2996
153413
16040
66286
16138
50477
94208
137323
2701
45013
125462
96262
107195
12392
148355
2965
2410
37453
17426
2717
2550
2609
1674
126669
136348
155283
76733
2949
57077
2926
154580
2593
108322
2690
100542
6750
31162
4884
32853
37406
39264
2672
85484
8751
103015
146056
10560
41437
2748
144481
144
133356
79
116495
2863
12141
3060
2411
5270
48823
22713
128090
86262
977
4366
4551
3012
22231
137999
3026
18621
18012
2924
131854
2791
76179
96109
2451
125794
43821
13187
16054
58161
100464
59593
93891
118001
3107
3098
25410
109678
8769
8721
143060
132022
2769
5999
102600
1186
2711
8705
94035
2032
108806
15969
2616
21202
8764
27819
7538
55372
153656
6723
61134
2528
8702
2618
172
139820
378
75822
127787
120206
1484
830
32791
2870
54967
137068
127226
473
2687
2972
118191
28761
1838
44808
7865
126061
2667
31507
52559
74237
15988
903
153622
436
2494
147649
3046
2995
49019
124993
31966
116261
95459
33739
16009
2851
82434
11546
99634
134262
8659
462
2742
37359
146591
127383
40581
16294
25126
2705
2855
8819
795
87336
114
151229
8717
2910
101443
103693
152436
28272
2643
2191
8667
55865
4360
2456
82962
2915
87354
48451
2625
694
154797
82673
2574
3035
8648
83525
39308
2900
41345
1906
124241
79093
83160
153117
118258
125396
90342
2903
61711
138016
980
124019
48997
43982
2951
2023
8732
62209
82794
158842
2572
62057
18471
144921
139937
5652
8709
91314
11691
2756
45910
3036
2566
115337
28020
119558
99211
8652
34760
7805
2220
44529
22975
156071
91397
11651
32125
2591
2723
77044
7886
44221
8689
5622
3023
3021
6203
1449
12360
83027
2639
6360
2736
2400
96090
1456
16013
79141
2913
2877
105602
223
3111
35449
10307
41120
44288
9916
52026
45519
146566
8978
58727
109423
109103
31147
9841
2843
130810
11964
155713
72516
42783
214
17896
68374
65901
2680
122782
51910
12249
137931
2874
4331
2103
3002
6
134772
2038
78903
3059
5401
1861
9443
149390
21567
72118
98569
71092
87038
34709
44048
6754
2716
6252
47792
16956
8678
2445
3902
8433
2414
2641
95480
129623
122412
19237
408
69485
900
119714
89283
136612
87422
372
110954
18812
122379
2780
1217
143369
12330
11198
106847
163126
49225
3025
8694
6479
98616
23239
3080
87195
2811
10458
2844
2997
35232
8711
54873
2937
144191
117438
125451
19741
94582
6301
155425
17137
97375
565
60025
2882
105597
47
2504
120481
1953
15495
102148
146728
125386
48744
93587
68334
8731
1062
75903
112739
13333
109756
2693
76318
1598
3009
59843
1366
123417
83744
137320
110859
108013
2665
429
109291
19623
1483
148593
2047
2614
7647
37348
110185
149830
517
62448
101396
78205
8697
83650
11332
539
8476
108819
36967
65110
9003
329
79707
29010
2449
2438
2626
18088
44190
20
87317
2555
44656
37393
80402
87830
101742
107225
163718
21448
19227
134802
84580
38195
156859
140761
3405
138106
3112
2912
53416
27550
1078
2623
1853
2437
146257
18613
3074
8634
2478
6897
67970
110688
162939
102471
5704
2890
146279
45481
6370
53055
133284
135743
111004
78127
65112
70735
3064
44142
28389
20597
61951
4619
10941
112800
164020
19160
22038
151858
3102
79033
143198
153666
78981
25872
163885
22108
2466
17057
142094
158691
129565
33019
155363
22425
127888
88495
79906
130503
44429
147974
160262
37247
150274
2553
140647
69740
115042
2582
156729
93082
102205
8768
2731
108082
606
2545
9513
86404
105150
39903
2966
130577
125245
7617
9289
2558
133960
64936
16076
163510
3173
6890
124339
147152
77150
91540
8734
31976
112561
2587
98320
8969
69399
148023
154953
67287
2896
13397
2655
28864
2700
5004
69881
2507
43220
9699
97020
89637
98948
28160
6885
125935
14324
12024
21282
42917
120452
89808
137867
95278
159611
5647
118036
1557
157366
96746
69775
2441
88327
24054
20782
54270
9755
12256
2040
8635
7662
87370
136216
949
4377
16197
41758
19100
121244
6406
66335
3027
8786
160900
8643
30562
132756
132396
95308
6164
33172
43168
2475
131533
2161
58241
46228
20769
2444
83022
69802
62443
11179
96594
98311
143396
32038
133352
147501
140024
2448
52774
44437
28086
115918
76466
2417
11380
121039
2578
97912
23787
8593
81797
118242
68478
38848
11433
54749
137149
731
114081
18482
101876
88159
146652
166
97735
37230
37929
8719
7746
110209
2635
126034
7312
35300
41792
5251
97442
84639
2776
2817
69022
3627
140378
91185
144412
8757
9948
117317
40664
21480
8784
139181
31999
59153
17543
37310
7836
140866
67068
125651
61383
64065
2554
2721
15989
93708
73716
633
2879
107560
18847
84546
125274
110085
2906
27554
104515
85660
2952
58622
162668
2909
76001
2198
38395
107153
107246
63859
131169
3030
1611
54831
128605
56626
95593
135992
17355
2737
7228
2681
8724
2970
21813
137927
71696
4368
148570
2881
37372
2342
80862
2225
2497
17026
16436
28091
31074
31
78309
2588
137479
113482
1852
9683
154203
151181
79603
18558
81636
98583
95859
106912
64226
10367
96393
31712
18352
88992
90456
79074
4723
5670
93749
75931
29008
117886
58982
7577
13317
14548
72467
78357
87440
20336
18827
39764
45110
103243
126508
8736
2720
13523
90632
4754
128499
4317
96805
42559
130001
2605
15256
8798
119341
150493
61202
5667
51316
2810
134359
85226
22796
10177
62880
104612
1016
154454
111409
62873
150305
3122
2544
123840
111296
6040
104713
3934
110808
8772
108506
135576
80148
7453
9514
3029
110359
285
31828
16003
125717
119584
6792
2989
95863
31855
158190
139311
11748
149895
2473
10353
17509
8211
81939
240
60707
135234
413
69848
2894
2501
6590
136414
11950
6102
150300
70982
74976
115182
48268
63374
1641
25795
57723
94910
101852
8685
94262
194
107100
14339
46536
2270
91157
59413
54801
62044
16086
16505
47495
97898
98160
68005
119348
41674
310
88107
46669
8344
80167
1879
105565
137963
2585
11163
122292
22883
134900
7818
64158
67670
3278
2174
4923
17636
3816
62841
61373
149343
40119
109428
67996
8683
161806
105172
109184
33380
9804
29862
3290
47155
662
48506
148316
102443
31637
17805
71879
2460
20029
128074
1713
8804
658
122741
96730
2402
112925
139956
90937
124999
131887
108644
97478
150671
3056
119879
122119
33697
2428
91154
58835
123224
40523
8434
2537
105758
3596
2181
74766
16285
3654
124092
109319
55465
29365
92453
2606
20915
42360
2974
162172
148187
76397
3028
42594
162932
4155
36247
2212
138535
48234
35021
125389
7873
52115
85294
128380
148325
2752
42995
63699
3996
31097
9629
137464
107317
344
22980
69805
154475
32707
153310
1308
117386
59417
88810
111552
151223
858
149406
7752
1104
77004
39523
151508
106426
148907
27523
3113
58348
97687
456
150565
2777
144697
122835
24789
132194
45271
130261
66086
139344
20151
66651
76083
130790
2629
49343
5612
2727
119887
127853
54810
160828
12679
16056
48987
108869
12936
64091
80613
111864
3075
18560
99643
29665
24037
2067
1200
29946
3051
19016
31971
5491
47838
29493
2139
30872
57583
128507
1274
84954
162733
49428
135002
39494
87350
141962
3240
126436
44249
77744
6233
11571
2642
2691
44484
9538
66817
159876
6253
84530
89882
28095
9132
5233
61108
35089
41539
6047
148573
3746
74329
145483
1871
7622
13994
91386
68191
110420
48207
90980
101811
107024
120421
152583
313
98613
94927
55977
3242
11333
134339
2499
103818
97887
58676
52696
1363
21875
16810
3281
102661
6071
63674
160352
17073
138825
29939
133222
132230
121708
2698
68409
64750
111297
12295
118277
76248
106586
69034
129999
3116
66451
8754
104292
112639
1433
94307
92640
8516
143059
98635
163374
72747
108178
151434
151251
54641
3086
106524
72564
163172
97308
10343
93275
76745
97659
43245
137854
33982
4867
90505
138229
82273
110313
41594
12707
105067
10319
62032
972
99984
108636
2407
78041
108218
65423
87458
19663
145362
109817
9887
851
73297
12536
71803
84618
124926
16908
37264
668
58096
7325
60069
4781
114650
110461
78816
118341
29563
4079
29598
12167
56019
550
62655
1497
12407
133530
56374
154692
93539
63312
61345
100241
97999
60809
58425
113579
11910
55305
70297
119085
83536
109380
1757
2595
122522
21502
86860
124004
21469
77287
2801
151346
2649
156072
98304
98348
2511
133581
95039
3114
3104
107133
33788
12218
59655
3037
156199
40012
2999
68632
152921
1867
73904
147858
98905
48901
47322
37467
1178
130279
41358
87746
59394
699
97950
94846
10250
2469
27245
163864
2080
18385
108277
7295
120623
3110
134046
3711
123305
110855
66284
48378
213
55895
23563
3072
29009
125784
1876
3058
73283
62211
21806
62994
131123
21458
62764
123414
58117
2928
24298
2471
123075
8656
50007
44544
84727
4720
37493
102344
40306
145696
41915
76309
105082
2805
31426
8670
88610
2519
108033
7500
94
54908
202
110564
134149
142231
95665
25109
2214
6711
127072
115547
163439
120579
90680
748
81142
8030
585
8279
146036
56029
123185
1082
84973
87467
1304
368
88491
46065
102354
27889
57315
140609
126003
97381
97367
4878
6951
47947
5
91344
30493
140577
163095
65546
3391
44899
87555
1015
92492
89388
157762
35010
150849
5378
2715
13251
42267
66936
17348
8668
88993
163314
84765
114493
10117
118396
80915
75920
65382
87494
24198
2026
2779
79592
2638
8802
2272
108721
245
86975
82951
71930
4351
92018
9810
2560
122696
65410
130553
12075
81341
160513
89345
135447
19079
1388
2876
73083
81257
112361
63049
6474
26023
2430
119200
79000
1653
6729
51100
97759
108873
40775
42984
160281
9511
155209
120653
18747
88917
47391
120676
28335
23995
162016
81677
2685
96300
11533
129486
38580
53623
144632
24208
93676
140859
29260
96873
22843
91629
8791
25717
15000
99361
151579
134281
8723
59213
49798
78188
52199
82979
162819
44561
105845
27299
52513
135815
92058
10614
125394
91639
4757
54068
105169
15342
144350
51282
32901
60192
4326
155771
160843
11407
61228
127446
14600
93402
155
108076
23801
132555
93240
12092
549
72669
8730
3888
161749
2502
47309
2767
3611
152973
159430
80248
2049
2503
77273
138795
28105
45685
34962
17835
8748
2746
6832
55177
28654
76744
67594
139861
52375
135695
34464
83116
145893
96052
42472
75197
2806
163455
140210
135190
59021
105001
9054
103901
11194
24730
2013
56224
46095
79965
136838
31760
139125
162980
33675
8795
6696
8733
19039
38439
72129
160670
91959
93833
123200
143845
67019
3991
90816
89000
21675
27053
63827
32510
2775
108954
43986
112170
37840
150039
387
58808
56336
80546
96686
115372
24408
105062
102825
37627
88546
54330
124735
5276
20382
142894
143017
130778
123608
133519
5101
71606
4955
41707
49002
129832
121956
120761
55878
158644
13175
3356
56841
130800
2664
9304
129376
149500
93729
15460
93265
117450
119625
59892
47803
135101
42739
80796
11401
120172
84891
125107
62110
30537
16055
26834
11132
98660
16446
1407
85951
126765
43320
12266
152400
118226
40281
144422
40413
2420
107556
79675
109708
6086
59877
135266
10666
4224
87262
73913
99004
65388
129162
85347
120467
2948
150716
108077
83262
2435
17530
97038
9280
63934
28797
103979
35573
41253
107809
66200
1547
29223
7083
46662
123588
1994
139516
155147
2514
94977
69851
108151
58747
6561
16005
23498
14112
5106
799
47805
46610
40239
39205
1702
4705
98547
10403
34667
80169
37513
53501
6414
94434
5646
35540
707
44986
40634
29756
11682
27296
62026
70836
38173
78588
6267
71933
60825
155950
68373
32201
91255
391
102896
135077
149261
121324
21980
8949
14607
133241
66526
79805
16752
143139
156553
113257
16946
17028
64335
7376
97725
2122
150407
106045
134980
141816
71822
68891
117655
11299
43077
121174
393
31864
105601
37355
135189
118275
110016
2957
102514
105594
59511
18379
72271
69051
41371
60519
71113
132375
92172
88544
388
104722
56662
132723
98676
16705
77490
132504
29674
2151
107694
48091
14240
33352
83289
4666
135554
30909
130978
99561
125400
114720
9599
110651
97899
150575
160275
117348
32511
152897
76194
2819
91556
55487
6597
47013
6276
41004
120891
90065
127361
17873
123030
101695
2240
95897
129532
48833
59091
127043
128436
4545
2627
51433
39902
22049
118303
81761
125195
127931
15990
6118
38981
98760
105223
111109
64977
161551
37472
78977
38949
8801
77368
8725
82014
1125
79302
99058
38866
2610
134936
69076
9325
68546
133093
23099
54926
6407
96286
122799
115779
142
2323
65215
63622
67836
41746
122066
56008
93822
3895
36625
863
57854
75022
91237
107636
19179
31957
613
96368
86969
129704
98090
125465
111803
11357
55279
47316
114861
109548
86919
60151
2472
138069
61555
125305
77496
154196
817
4516
51991
85248
98599
131656
9284
91695
133191
68305
2710
21645
33
26216
63893
86764
119190
65735
21066
2285
2815
79771
88539
90084
88600
157171
8456
36845
13496
88928
99288
53417
131352
40047
130654
6087
63582
2429
64149
91056
1845
105405
133980
152215
15432
5392
38299
9816
88582
17022
152194
10772
17077
95497
28702
65562
79151
61745
105789
110594
53541
1409
91479
6943
32535
135126
156242
119124
1008
25571
59238
16020
102513
10459
108697
2771
27385
35093
16132
90269
114546
24864
96975
90420
126172
302
35112
146131
91075
66550
66481
51529
56554
7022
142462
7785
100355
1051
4405
4726
89969
27863
1463
115757
98191
66450
21424
65363
56493
122684
29520
47179
1977
92933
57373
104876
44859
98383
808
42981
68822
80498
47763
149042
9759
100408
12006
8391
50426
72340
58583
2612
4880
84347
2500
124258
51594
24544
112892
105437
60072
47940
89646
159506
70746
52341
83636
11374
82096
133435
31150
9121
112231
95399
121421
164206
16400
127523
9742
113841
110221
6753
2897
118727
87299
84071
65058
8763
73417
140418
154231
1967
2577
17468
113695
45331
61879
16033
138462
139721
11363
158777
74066
80516
76065
122570
8942
1184
99345
16140
11153
137032
79011
2967
148721
114464
3770
75303
65570
7001
45544
122158
33744
120584
22629
130313
72860
91275
77584
119551
108911
5590
124392
32761
28572
84286
33593
107093
8778
12874
92590
107644
5571
125234
26537
119413
148274
93861
102191
110851
113351
29775
150678
80839
18350
143627
193
140764
8443
136209
116343
103727
111594
7871
88661
131038
50146
132247
11916
115988
125634
92182
110538
123742
68615
101627
45052
98139
44734
78075
56097
9959
83438
25033
44051
8681
26180
147290
57179
34841
30811
7412
128796
6034
161362
133453
58423
141662
121778
109333
61128
86684
16023
2153
46685
38538
133899
86629
2224
27517
78859
5414
126963
120266
120608
86201
145663
10490
16153
42058
80639
37385
97412
145393
54360
61545
31088
18212
103451
46152
135003
112996
57498
31358
93745
70338
8787
125375
72991
125251
105881
2218
112919
24588
12232
149132
20139
133347
1603
115778
51507
19808
95771
120382
19437
8662
148882
118536
114116
26982
160676
14110
31091
146481
126526
126062
41411
88515
78723
56501
163887
78635
161152
12313
152112
75626
40871
65260
72194
15592
58625
33259
102425
139940
106243
136454
67011
86867
28679
122857
47331
81065
29489
82986
72394
1301
63810
128666
87119
111447
6751
4775
90037
160587
29299
49198
45274
5468
91019
76978
111533
1262
15348
32801
85972
101585
44657
27571
98192
88113
81240
12424
1052
16979
56201
1228
14299
59053
139297
40262
72532
37459
113092
120002
114375
7179
2891
137066
97164
156353
151626
69730
34522
1773
15993
159053
135404
8591
23468
107926
8753
101410
105568
43273
78833
95869
2884
98652
15992
133218
57793
143004
125073
105503
93021
2694
60511
119977
76615
8198
8715
159803
118952
31743
27148
5340
34890
8737
59363
478
129751
25537
28200
120629
31972
67298
97378
53249
140083
154403
75826
150269
135091
135908
119462
148423
102235
109104
88470
39285
149262
98332
32690
135063
671
116844
21049
17436
6029
161542
152082
119423
7875
979
6717
101650
78990
85695
30876
10884
42298
54753
144974
150367
53487
109347
86794
41736
153194
67200
3245
30959
5947
58097
27730
36708
13083
123246
20354
95989
149107
100442
112076
43433
8404
497
124894
163791
21226
112102
1436
52691
98458
42894
66632
63327
87897
128433
81903
114828
58729
2486
9885
139284
91583
118212
89731
124093
126145
18292
146842
124121
13594
98085
1337
16001
98478
74603
76815
20022
101259
42943
92414
38315
139487
2724
65405
21162
47033
161880
144742
10916
15718
43047
67325
42086
81739
26227
89403
124548
110252
72495
56887
150496
29465
82454
142613
55505
10893
21727
117492
146423
79544
45240
42823
120701
131647
56242
54544
54656
90745
98376
72475
3010
73799
128373
115702
34938
159356
67561
25196
67400
78784
51186
20020
18321
50172
146541
112694
33516
27549
162958
51600
143390
86536
36574
30898
34747
29817
60982
92094
6741
140799
142328
159567
45639
78282
66700
118957
111258
123149
125262
38105
121580
1107
617
131791
15749
4670
76340
138793
112450
25479
45802
15640
116681
7798
114301
164153
62240
17201
119195
3109
84949
92680
81819
124601
109614
47604
80446
73623
122948
124789
102473
1923
92974
31952
74152
129795
114416
93470
78630
151882
77880
62735
104310
10067
144589
63822
141853
133503
2838
2133
23942
27185
39584
135017
17294
89072
34295
154912
78098
2112
65676
44195
1474
81730
135614
7443
821
77402
92906
97889
27152
279
54428
88415
39125
46489
56484
110850
42442
92943
149223
63930
23105
31353
14884
120543
146360
160796
68491
110774
89665
112088
41366
2725
15139
2515
92895
124578
114472
65171
113630
161848
133979
16677
5072
13734
7608
139103
102414
151312
106975
34288
94461
44448
113856
75055
98646
2622
46333
77502
15987
92792
161258
54832
134486
42001
8803
50280
156664
14418
37973
91359
156858
162076
129282
58309
150001
2547
59673
31559
157138
24586
8647
72482
57712
132071
162088
133834
161429
14729
12414
27597
5057
126670
11494
123968
99366
52687
151173
53703
102444
60493
50335
111957
45201
22125
61776
88972
4894
92700
70472
35773
120357
22591
145512
6331
24102
126730
88766
1305
35397
80207
42860
11908
26443
2060
42931
93313
50696
121710
145131
55261
60746
132445
5809
47108
104480
145929
61491
11440
111794
40297
66496
23122
69013
59285
66474
45657
16085
5341
106911
81591
2314
7633
93226
34949
110484
162647
45053
64237
12400
41695
19208
42172
144531
84247
13666
89193
29611
76948
6338
5661
2073
76618
97188
98807
8727
131354
32133
7854
126841
113791
8671
87478
12430
140630
13339
99770
81362
133985
32530
460
139747
107335
70858
119672
51976
6340
71
133572
51454
105636
71738
75608
164062
121181
84269
140343
10714
52842
75015
39604
9965
115378
83619
20704
98498
2512
4190
8452
104164
129987
93290
147321
19979
116158
43046
2412
107743
114439
158853
51237
125063
95905
52249
49990
94426
2962
120604
38974
68032
117482
1099
66698
164177
105947
62297
96670
121944
49181
123
9795
155078
1621
126301
103464
141294
6196
111028
49719
23465
1793
68187
55
101359
113558
49173
145321
156484
83675
1317
68551
2557
114894
89470
132023
24788
83367
45130
115813
115078
155267
3018
19119
102826
13442
81775
4123
156443
42422
2637
25594
87378
46980
67237
93921
68604
24966
659
97193
118506
10189
94738
32153
80583
8774
36518
43937
99680
120030
21068
106789
8641
108726
37977
109697
147394
92662
14941
5784
146028
16509
61907
22874
1050
161157
12595
83041
142315
109192
109089
105882
95033
2362
162540
8654
2793
65930
16665
10524
146531
2601
62618
145574
34399
152086
132672
1080
53659
79100
61634
136297
373
74873
45883
18113
130400
26813
13163
147793
31733
98038
1320
59994
51215
18165
90441
11736
41260
58358
79835
44069
98298
9273
52116
38256
75423
88941
55008
80287
90383
46294
104216
10358
67382
65906
45495
44399
78046
8679
94040
34095
42502
74566
154746
97854
65466
21590
12064
54100
41666
132458
12243
112488
54084
37759
23200
146888
35195
77795
77507
57106
105195
77382
52450
61116
85511
60693
154766
47700
10027
14952
2525
110424
564
139818
94030
162976
15165
2597
3400
157966
45952
16518
24630
81710
81963
113083
31483
17576
98488
1575
2968
117667
151898
108626
119534
929
136886
84859
65371
106889
55599
71324
41494
38988
35644
16815
17664
19832
74871
115212
12501
162778
3632
21384
55784
158633
80954
51841
137445
35519
138770
1128
29877
112936
16080
5631
88876
32903
122228
154512
21982
52394
53064
37541
28926
127810
14529
117736
69103
60286
19116
128385
12162
41977
2252
4701
29758
31997
41807
79105
114265
135586
67959
150293
76278
57137
106878
142837
87090
55420
58737
90072
114386
6824
3247
138717
98528
88645
41738
127079
68584
17563
32474
107127
62559
150657
11683
81183
63951
63869
18044
141000
104127
111007
115404
3894
3745
118643
36552
133765
154892
46857
12051
128151
58968
32811
58332
6180
77235
41277
87186
115291
2659
118388
61588
58439
32514
34774
39497
76704
163554
5321
59990
8716
32542
10195
37978
138000
156714
23409
2980
35315
43574
57813
106062
16510
121570
8256
122973
15415
61767
5606
14030
150410
1355
2035
23975
82457
60604
18387
61097
16521
98550
121446
39666
88100
61967
127843
79828
128034
105599
110066
3117
3885
39438
65958
108875
46275
156198
2287
35119
140937
69292
43594
151431
32939
94261
120939
94809
30229
24797
41817
67615
11322
133590
91040
76175
113009
89706
163469
59138
102456
76144
75981
104217
108453
86687
20484
12341
26189
111897
45253
75918
121903
98508
54601
65154
9924
12797
19401
17612
48394
130825
24030
7801
4862
55365
100281
76236
81355
56496
28700
74784
111125
87841
3441
113808
29099
1711
14133
134228
30993
18770
38730
163950
108493
39790
150290
43203
111353
104260
1001
119921
7522
133323
111434
80202
2869
25418
34636
9447
138071
152640
132155
2037
49068
101044
104410
9807
10892
2714
63147
50117
41789
77321
33186
137924
47881
1268
23382
101758
80072
130294
149488
44027
86080
25485
23716
93848
58998
15972
97517
14878
140146
158653
40938
102159
95225
94867
20858
139063
80586
2735
106341
149136
78565
43581
38629
122127
64005
118179
115041
24014
71921
29577
154778
68718
21426
132391
144795
45444
2001
63271
48662
17539
10545
41841
24576
57932
3563
15706
32627
113114
94203
154458
2319
6686
134417
94301
78122
2981
85967
105745
72047
2586
25584
78577
8096
7224
7949
33820
135673
3299
62833
12528
12428
152387
135685
43691
95941
146222
9919
57124
86648
106994
69982
155917
108866
127362
2583
66595
58280
141501
42896
28695
24849
93100
1609
58877
8356
123128
16084
103725
4728
61445
101386
99073
134594
6371
54825
18628
30159
131066
69718
47755
3039
74944
110165
99828
73648
13602
48880
102364
91914
15536
29133
123024
66835
14937
21791
79425
6365
101551
77245
101246
122688
129861
19755
33954
2866
139859
32750
78589
122496
27829
159409
89021
2203
74147
3201
148622
92001
93395
137646
20625
148706
11289
37539
46599
82015
96977
100065
35928
26844
677
48530
55859
62172
133153
58398
49441
125728
3047
129600
90306
87175
16550
85627
9632
135956
117014
3531
79543
7962
17812
80952
96871
9454
124854
77556
14197
82515
2039
69031
140
141634
132343
139456
40504
4613
136971
82254
54123
54206
11219
22569
56552
89486
86568
78570
38300
52010
69357
63273
135240
17461
56821
163016
155806
127547
53615
147331
90742
153557
61057
56526
114746
162707
10494
116905
139109
134350
9380
18883
7537
29035
48382
97740
95716
98114
73816
150392
1307
29147
145865
12365
79066
47597
134831
11107
107083
60628
8704
63591
62733
93843
160091
991
40908
48130
78369
59318
96991
96817
12886
95035
161809
1153
78115
133176
154638
109207
54011
73525
80604
51668
70790
144615
116425
150038
105031
2522
60002
160220
94147
57375
54141
51083
140338
11587
122539
16014
43940
68843
33814
109838
54369
20397
39518
111557
34658
87067
125723
51418
45782
6072
156090
145082
147885
63645
46319
38644
27709
108633
118251
96929
12321
8277
58666
35556
158535
1123
1448
53250
69183
55771
93472
104453
98279
101773
3678
15320
22310
94663
24318
8537
103879
49367
79174
27531
128102
4298
12460
7284
161581
14447
126324
117910
69649
36616
151802
93709
147031
4796
2346
21108
95994
9571
38789
126968
83973
60542
120802
62773
89525
97998
44482
97341
6446
4526
49654
30664
62969
47535
7084
5411
24244
68647
28913
94207
66971
8767
111495
147012
79199
73320
137610
110173
43362
78430
48153
100549
112878
146414
50762
144873
89117
125399
33464
2158
11555
58831
138746
91155
8673
83406
16442
118468
75877
2850
20035
147516
8493
79433
27330
92711
8780
3041
132748
86707
1512
64444
23419
84515
48500
36464
78296
129606
59737
14212
66891
129957
85716
146264
14123
34640
78426
42560
32287
132581
1568
149963
72106
151511
109452
9688
138319
121192
95079
35880
54269
58474
99952
4593
124203
111314
12476
128747
124094
46901
91611
113389
15513
92955
142282
101254
72441
30640
71315
28852
88456
1402
97785
139229
95390
132074
54889
41925
71557
2633
7933
84082
1958
81407
109713
11049
71392
4907
4997
154870
29384
78157
106226
137752
68531
129746
84738
35551
60323
96495
63620
5082
22494
135534
50223
74649
54107
125269
151109
63422
98593
26325
15924
53547
3994
56037
107125
47546
9923
12435
97696
34057
136418
92599
136709
51148
148457
16916
68447
101836
49732
25229
11439
139390
2359
16241
12188
143452
89377
37344
100635
2576
2858
94990
57691
37411
158204
120650
19209
151456
49365
77337
117662
95861
459
125445
123197
37890
64234
16071
89329
7830
49978
75250
33951
163535
96391
54160
96864
20213
153483
77676
41265
121
84437
46349
143740
141361
139244
82422
3305
25274
139324
72079
153207
92374
134979
135029
72333
158378
21380
85363
73388
135683
12922
105687
151202
62069
41987
94143
45861
76526
88670
121025
2025
57525
161787
18460
3486
4391
119863
6580
146885
563
9744
127224
118236
151317
162711
23357
60048
121594
70414
87180
161223
89008
160630
31970
6716
26234
87000
82086
86148
42983
146051
16012
93567
57744
139188
122121
95338
61499
69300
69955
53633
18203
77775
103482
57858
114218
112634
19823
28383
9576
1183
150217
54388
76467
48334
48557
88948
27986
26997
110179
113907
17379
36391
80212
60881
77211
60104
98518
154871
146118
142701
109237
94983
18909
25987
64257
2135
59815
73562
45434
37337
99003
96711
107713
20686
33678
18239
128758
86722
75453
86605
91011
45085
15553
98509
123943
104982
98496
128450
7530
52985
567
122148
90295
71850
28365
98746
2540
89339
72082
28757
137015
147190
43936
21059
9028
65291
110773
27230
108947
98533
132101
50297
10608
162048
65721
70507
143567
13825
112894
100004
102730
56431
61538
68603
3093
42053
5787
87685
132227
2222
130907
381
120786
42567
27404
50871
108764
104245
86941
132979
13017
60657
6254
63576
146187
116480
74331
38238
63335
56250
118919
32082
20937
142674
15074
120381
4779
106284
73620
31747
12859
45127
66079
136593
57630
45033
98634
89512
111020
1345
159609
17588
55394
79346
59396
8718
36307
85868
108252
13742
54143
111727
48908
155421
98473
10175
19258
72170
33289
111478
38747
58338
2580
148763
84148
97602
110314
49963
106614
49746
131114
144203
52556
78908
4632
90407
53328
29229
29955
29267
60950
85956
150885
59160
2457
142781
137170
1066
99316
123150
131636
155947
52361
42233
22951
29816
51424
108401
5643
67464
89007
78241
18270
60194
67220
17322
7989
86914
97458
79790
87220
10613
133525
35026
3936
95661
77734
153109
134866
7947
14257
64799
110861
19035
1055
134845
114329
72513
11425
141763
87610
15533
73990
9207
143921
122638
1762
68554
48989
59928
103148
73342
87375
74803
128674
133523
500
161952
12010
12416
19252
147763
145171
119971
128364
162424
69654
100173
37036
102094
30119
13986
143538
57558
107862
107781
79257
33183
9022
67820
161387
612
71211
135569
60938
80875
49688
993
48867
65746
145614
25752
159912
126333
5149
132372
98632
6305
145184
155793
49612
4479
46229
40150
128954
1725
8897
87561
13016
28993
79615
162782
46962
141903
49422
38928
67697
37783
120243
135578
9762
5575
137415
5109
44487
113385
9818
158593
149295
6475
72822
3484
6073
144617
2722
122032
76500
105232
61053
60649
149341
53575
36486
71250
99416
11226
131304
77657
78604
82989
49653
19899
100518
35778
107984
44021
99061
59198
60559
69454
7433
156897
39729
70104
162853
15236
162898
154843
34966
136195
67690
126053
120412
87156
126976
151867
111027
148334
40278
151774
129722
39129
13977
59933
1956
20226
99580
41406
162844
34175
40835
136111
5011
89016
155188
34541
58
72385
54705
315
77677
113314
95552
127212
91691
115912
120305
127695
28690
98575
20664
113362
32745
75230
36911
136535
71371
88770
103834
46680
145695
80309
44718
96139
6787
98359
6055
80676
45700
160290
41658
13119
108691
76414
69491
11720
99306
38922
300
78880
93706
109621
90286
8494
65316
1813
47078
50449
78841
125539
81598
46380
139369
96931
37945
112769
120892
110074
125407
100259
18550
132095
90355
60516
140236
26330
114428
87168
31078
45536
149
146761
44823
30240
136108
16537
13103
79746
108253
3176
49112
151637
12025
90318
154553
41195
133247
144483
1542
2678
126240
60669
89789
22820
97778
111865
6875
18302
80233
152421
588
31679
155386
113059
2534
152646
69041
56436
36462
29076
120857
135507
57123
85743
108184
61263
1049
10536
138623
70159
50015
51126
17167
131907
32721
105206
35032
60870
163478
110099
121095
29590
12261
60577
147533
807
5781
116193
45844
74437
125458
16057
77681
27574
28503
97072
65408
143316
125525
700
148362
90034
31636
89495
133869
55887
62276
2982
85977
115929
12318
41679
58508
95189
35003
98804
10483
149579
58516
109587
46166
72795
51139
67654
44159
136590
74768
3099
12645
4599
38553
57090
92631
107585
155496
134953
132552
158655
57505
68931
55458
56390
8808
28451
125334
89897
106996
24312
57863
70874
92669
91903
122459
31739
15658
2381
14164
58024
12049
98182
86886
97083
59399
137439
114263
69020
127008
135334
42362
84431
68342
163346
124448
56569
15049
55840
57534
107012
97850
99473
4355
45151
119830
109836
82233
116046
149060
62241
44784
14035
82544
10372
54344
101671
126855
11747
14365
92965
128423
72496
2521
78595
70
7187
57447
55854
58704
124776
35369
161402
162641
25027
129210
48470
129513
54788
1975
100507
93501
76655
103344
66733
18693
112382
64152
112359
133415
24314
8712
4191
123816
59764
5777
93877
54179
75982
17306
7620
103182
11957
111456
11687
117999
76544
60022
70269
127800
108405
29619
115816
123614
40726
69474
3070
49145
115706
55626
108944
36538
53414
22736
65144
63737
56210
99303
44434
8729
102618
1296
133964
47060
93693
141051
76696
10920
59553
164241
68205
25562
6659
46771
104465
20287
111630
28207
47796
15997
56509
110965
152699
127744
87092
122803
50712
132033
18565
100261
28063
116730
30375
38718
20488
115221
106898
125325
6865
89371
54850
142339
112655
10645
39040
89172
54792
9891
80497
79178
116756
9523
51935
121616
19118
129873
64487
99417
159251
9254
608
108849
70082
133710
44419
111545
145595
116073
11840
3042
135623
114128
32659
52960
85054
98275
92044
19329
63458
73268
70207
75677
122003
152093
125588
103859
48143
44854
90570
107719
59024
3043
141230
109179
65438
6862
101998
8222
28325
73934
126177
78946
14712
126908
48283
61163
60723
42460
124761
64389
4987
58951
13471
116979
44945
148670
47583
102190
65609
74929
36857
68113
104237
4105
50345
36039
123093
46173
7460
40902
128898
45207
34254
21562
126608
113860
37955
141551
146737
127852
11017
57236
21196
85597
63052
32717
42646
30545
73510
6127
119050
126129
16134
79734
10289
47051
23336
40442
13952
86782
55908
49596
141869
109607
18240
149567
66987
124045
24380
36721
7447
113001
109662
125403
152486
18546
109197
105732
31392
67990
152750
158455
144959
89389
157021
138017
1555
10415
18716
9244
83753
59509
66912
65220
152178
163162
148758
57367
17300
7773
64556
61927
122055
93532
88612
141543
122461
86331
11612
121002
30847
137230
37445
146648
32545
148953
9602
60512
20441
24414
60957
32062
114916
6389
91822
149962
152635
98950
139839
32643
37248
83678
2856
125413
124315
31403
87827
343
153653
53527
75333
59710
7340
516
4799
120221
128852
2324
5253
22442
128445
103969
78480
78614
56319
11652
56261
39420
157324
89184
6450
208
50634
64108
12654
71294
50990
44617
105604
97795
62079
16073
107218
157832
96538
88287
42061
68145
12421
4000
45781
61288
119805
40750
65247
65036
14615
77063
76136
140991
66742
41939
62749
158339
157695
27461
26031
14195
4601
13410
37614
126843
26611
20570
41781
4160
156096
7536
94167
98272
8669
41827
64747
124581
81927
56140
26594
104242
12192
104993
78601
70656
48324
139844
22228
8676
113484
5560
67715
8156
145289
97944
45977
44893
2018
145643
74207
136112
16259
90210
1073
124468
51484
8695
3154
67372
40853
32252
2703
12401
102010
4424
33518
151407
149094
62985
72768
110039
95709
153460
143114
164081
156439
125256
163605
93704
99631
4143
12021
131286
143324
140171
112038
116674
41398
150469
46455
73028
1299
96742
97097
6860
45291
154137
60916
70191
91339
96971
5003
105259
62050
63944
55564
55298
1006
95574
104630
12611
104333
64522
15461
17433
47556
4727
8738
47031
97010
61703
74374
128892
24518
4474
111500
90665
161943
136820
95998
47119
112202
106326
101902
142529
42899
147940
47988
105735
104032
14158
66333
68919
65485
94792
45907
82002
100137
2668
34851
29963
17666
111056
5358
88363
106982
130112
5259
32312
83913
37031
9954
94829
9889
50697
40480
72782
74368
6773
22469
133509
119465
24883
72418
84401
86199
31626
16877
117967
118910
62152
84039
66577
32808
80359
96320
148426
133937
101326
131319
16231
83983
7014
82232
149560
163998
109918
5509
44075
151735
98204
26239
91307
107215
65081
17716
76216
22609
16135
78626
151748
1196
86948
134257
154887
93503
44317
152118
73305
19256
66078
112931
88477
40171
5224
42712
31285
78636
153526
100188
41671
158614
132159
626
18007
101203
133517
89705
80886
21126
98111
121259
120246
96544
82024
104455
27189
90866
92218
15222
133248
99823
127170
11520
59796
10797
25343
35648
129525
59233
56044
23227
126904
94716
97657
67512
2338
116758
99837
34412
84962
33505
91078
76094
122102
39468
32274
73958
119247
92286
155833
98427
5098
132475
7354
135917
154206
161373
64128
96079
81788
17772
76135
24745
81176
34679
145291
104757
98179
26751
79301
134292
140366
69902
159175
125264
71702
27915
3402
119585
79924
49376
49533
2918
127369
134088
5856
133046
120613
113013
117723
107767
116735
140990
118061
31616
104259
41475
8793
59252
68958
159907
63067
130396
77320
8766
33008
57972
31570
13628
27369
88966
40636
12802
84297
76380
33799
17122
51710
26374
100682
18540
138035
44643
64011
97401
25048
22470
76176
73813
7772
147622
122801
41731
42421
127263
127249
161700
62212
95842
35990
36110
2238
34202
44975
107460
91420
36146
151228
27935
87309
118556
139120
58956
17619
100792
134970
84390
130940
22768
55326
135885
163101
79517
62452
161875
154485
143862
108286
82932
5210
82032
135744
48034
28950
130838
55367
7428
156691
7360
162873
78359
109451
98579
140946
67787
15958
54481
59071
50232
38854
29748
114276
15015
31923
9709
51669
33731
757
156009
30079
43854
80365
80329
49234
72296
43326
97467
41434
93459
69296
29165
122790
27302
123249
5271
77016
108995
153035
69479
905
41455
51457
33270
57329
4770
132471
129667
130844
136461
155663
280
11495
83237
89809
35159
81669
107131
121786
125899
60308
57733
24814
28440
20102
129554
148216
40901
94025
38472
159984
102299
121566
92743
86190
95854
84541
69091
156358
104431
68325
31985
81462
94574
90008
16709
127575
1375
110404
26808
122578
137050
78680
133616
24443
39586
137808
8785
35854
38065
5796
34088
115659
58608
112863
140298
110710
13840
58384
122246
139699
17141
85384
55275
151157
31143
53888
127815
138922
44135
95014
28404
8241
108670
84074
148789
123303
130315
111910
17942
59719
120642
147662
18624
131305
90031
83143
91521
93272
3904
114989
29726
66788
120848
22645
59376
125984
6135
25177
31002
139695
79904
44572
109221
52170
115645
9884
91734
10913
79042
30879
72109
29298
113540
77378
64616
112394
61169
157465
102593
47712
12829
2264
74743
81040
78305
111926
234
140811
109208
159688
27055
102535
64702
133467
23355
79397
87920
127980
6271
19896
103379
106027
1011
7914
88093
158256
26750
14805
16603
121480
11715
60538
19255
18346
21809
34889
61343
57685
156950
64379
38391
151473
125527
133894
41802
58216
51046
87311
114022
31263
115232
11062
37392
109460
4990
121451
143387
96500
114070
54911
137337
108024
81031
40051
8773
38181
99648
135414
20718
36114
93428
30453
8829
13943
106499
168
98587
124097
78498
80492
61223
12548
112552
45748
104065
61268
11861
65911
38233
120076
133588
45718
9784
29309
1063
120313
26969
107483
115209
71146
7534
127857
10301
103860
39588
130371
131442
115055
74697
19488
111755
75553
121441
132606
131581
102440
47478
143850
54548
126227
65846
117635
125844
110490
90723
144385
51611
148929
29870
49790
50284
34505
32230
131781
122821
29997
56751
80285
106200
85653
108395
101413
40951
101339
60240
119603
99790
151934
20350
85368
114525
97205
5040
70709
102121
30770
65893
33496
122384
87592
106723
2051
5660
8332
107035
133915
146352
3719
2204
66230
53629
52492
138118
2781
12965
137655
56071
132617
20436
158284
98434
78717
117945
118155
78218
156576
116987
93757
81992
96032
33777
73897
24489
152094
112596
12493
69278
132404
146520
94489
82835
111699
95775
14951
145850
491
131284
123587
9976
125031
135991
149307
2630
98018
92052
19205
87414
143370
124147
4772
37333
26401
150113
110082
21485
146573
67219
24502
160399
98206
117414
129381
82568
80295
142250
65451
3286
145274
25645
1374
136519
38178
1880
134876
26622
140955
82437
42622
137850
275
136237
140323
161333
18729
82743
122610
118237
25486
79553
57277
57628
64917
36322
98121
51025
66176
151114
730
94398
157627
44538
76888
5420
117525
151811
477
108801
159839
12736
145294
146299
93977
107315
12846
100917
20344
76449
9383
3568
51809
1459
110075
112748
145070
2385
120517
95698
26018
18141
73789
92825
46053
4826
5871
52512
1339
56543
84529
126701
21113
132534
68051
2389
136657
111922
7760
23141
20458
150
126972
123136
98107
20958
73656
130740
141339
32411
107913
73132
87164
60685
91301
133510
119533
119370
93352
41642
130657
123350
100280
17715
91660
1479
105876
133664
122534
39799
48061
156032
64755
135710
6156
11207
9711
136778
150395
109114
124904
92009
93786
25692
120347
1340
1989
79945
132514
58173
87003
157175
29542
110984
82994
91196
4822
104354
78936
96691
4702
16021
62107
2453
117447
119677
120395
83790
44676
16480
84295
115189
113200
14840
116121
73425
13965
92292
105407
152164
65368
16062
51764
86548
139881
84244
101685
158430
6801
50303
145382
99304
34285
136626
141842
16193
3660
54343
1954
123300
32251
146417
90345
118769
123793
49994
31044
50693
48237
123729
114615
439
133944
31909
79653
146212
83222
121637
2052
114582
19448
8827
45604
162442
3103
4124
111498
10106
16106
60067
140178
94245
54389
21525
47420
108905
109814
1694
66505
112001
153972
35016
16785
141192
163914
138945
19050
143471
94997
79953
60024
6335
48343
99138
39328
163140
109278
110844
121620
57362
61486
135200
96647
77397
75902
17207
83665
151384
47271
100385
66165
68598
76087
6431
156912
31282
33255
116637
8446
18611
138606
134068
58433
68228
57657
59675
30096
99117
131584
7806
134516
56642
111038
148261
13627
135994
12397
8346
148117
29022
134092
63100
136320
129823
134055
140330
156067
81930
5021
58160
1117
87475
22325
89453
105932
30964
33174
15440
141866
38712
152254
106870
54420
917
40143
23044
61055
71619
57675
115150
104895
126005
135256
21648
108336
99293
90448
14234
91743
161928
150957
55085
149434
97992
149969
98296
78060
53636
36861
111907
34432
150366
64488
157001
127972
89188
136558
111596
56053
538
154780
78011
75003
75235
31649
53469
92082
69376
143775
98323
58992
19947
102326
80322
68845
28789
44546
99537
78749
9973
103342
48583
11361
97616
16740
131886
113729
16007
17231
505
103800
148122
10251
88117
88099
81551
59911
29629
84761
93294
148126
10258
9811
93253
96345
15208
117377
139277
69686
154229
89060
102150
23625
83560
98527
124368
82048
16797
49169
161425
24994
15564
102186
65592
108332
37132
92166
37691
101490
30340
115629
15185
119396
143999
78064
8688
26026
59030
121775
125259
142206
158768
111127
133106
6651
127838
2405
162909
144630
2371
120640
59791
113030
120193
91407
1950
143465
41751
12561
106298
117966
111840
114048
59562
59421
91134
93064
4388
31694
28706
83442
76059
12992
18596
43405
2305
9346
7378
92977
62607
104848
112608
91762
121584
1319
19574
148997
10487
131124
5930
29752
59750
41560
51140
13238
901
9989
139693
104391
148858
148241
88969
9622
1414
73792
56660
75163
125326
116227
74141
14426
14797
70045
16626
80801
163758
17518
4284
103561
132644
46047
13396
126368
105260
26479
1303
118711
4005
22498
23806
55899
163793
153178
27439
88074
97988
1165
20341
103745
130571
110489
93461
29952
142921
144434
106142
44316
158410
41503
12452
12352
144202
47557
4951
143547
62533
119988
136554
113419
143055
141399
27881
88238
125854
133610
5256
63562
908
129328
40817
73574
110701
89822
84322
104926
110138
70928
52047
70875
57023
13230
115815
111918
132695
21423
62975
95216
124566
76219
902
106868
8436
117468
19203
46195
109527
8151
128355
32840
8123
107619
131289
110586
4939
25110
124226
140142
124056
116217
12545
12599
9247
92368
141781
147886
64404
11576
92193
84233
37378
98567
12496
8033
12795
80756
45897
100906
137178
128827
133996
49340
159822
164251
82135
20276
67331
131884
4038
110616
100797
86676
16188
45911
77260
5266
6121
139371
46037
88370
121387
113818
4783
5010
60569
57752
14023
73015
119079
13902
71980
114096
157891
3582
145704
112714
76218
13459
30441
33679
20134
25463
127142
69158
59234
28286
102748
110934
54037
131
120830
23293
33828
77999
143527
112014
85953
8726
870
144784
142898
61628
50950
111015
6419
53627
120916
39643
116980
160219
56371
110226
75245
53447
59011
51080
154601
90024
79083
120003
45820
25160
127869
75170
69309
30418
110505
55929
136192
158357
4314
79681
69464
4749
24744
81948
105578
58677
106968
147615
31763
30072
14049
5281
24670
77265
106568
2333
51612
30776
148951
9962
139660
61976
108711
125897
52670
150573
104355
30359
114250
145877
137419
93417
61579
11504
144995
143089
28672
45766
53589
45071
156471
159129
62099
77960
46834
153293
49787
91198
72595
93900
12825
88344
161400
163523
116304
49521
119811
111464
40512
22847
21824
9069
127236
42332
119365
19445
43686
37158
55946
141679
11200
150679
109252
121639
144609
100920
58592
21891
6482
65504
96361
32375
100860
146850
76255
142826
62650
44039
40107
14395
137115
23347
56333
98237
26979
83163
40220
144899
4219
83945
111547
20583
139027
27693
92692
141078
21670
56309
90394
34655
117583
119261
104316
99600
65069
5200
113873
52480
135572
27431
152318
105726
74775
126622
18719
76251
120516
4828
76204
120280
70958
144128
39323
68613
111117
108632
80878
100312
85851
6169
24322
85206
111808
36628
75150
41682
66175
2358
160171
89055
18913
104083
64244
51892
11877
114286
110467
5232
33067
37967
87854
73667
8745
78963
65349
163394
75867
5112
21055
15067
75145
30087
66062
562
93376
49772
71301
139494
44376
164117
141922
101867
42667
14517
113493
37914
55412
149350
149072
44236
62958
62189
39720
75824
125961
58059
4617
47786
160617
146363
129879
6137
41683
60532
4975
93388
58359
45490
59558
31391
153113
119598
113076
43457
135448
43856
31634
162629
118250
139325
94354
39860
79896
48516
75261
10572
32254
60850
38676
5380
61110
15852
109019
28613
104773
145671
111954
52024
46696
44665
144572
103897
110348
129610
3590
79018
147226
134175
160873
152620
123445
9503
79865
122833
15573
11128
102386
48300
1618
12293
6142
99994
62527
501
150177
126402
4575
121281
94094
60879
144563
106375
51891
44740
96576
22912
94121
110392
106913
8740
3979
79787
52312
124460
35775
154845
4304
81731
157097
89631
106700
89132
49587
65286
10035
58112
30154
56518
132152
75747
122838
30378
75420
2316
11355
98469
12573
126837
20663
13684
36005
106786
163453
12541
144443
238
25292
25979
114461
104484
8596
136153
51528
161511
16088
34849
56020
60505
8677
55483
79294
41799
88036
139910
11734
25355
88123
41391
51401
87611
10244
124842
91449
60373
126952
127774
69657
16000
45908
90370
69377
80430
30906
75167
69915
10576
27188
161055
25356
113175
19562
148193
77282
87447
102648
36551
86091
10657
62361
14109
148093
56372
112121
62842
153858
95883
127982
46158
158975
92981
123476
136378
151210
21750
6376
134950
84615
31231
36676
6324
97847
57924
11010
28260
122602
105748
106067
6661
76319
5170
147767
1664
21350
49248
96494
146859
9796
2674
57957
101937
138638
72551
49781
5192
18194
71577
81576
40374
11185
23032
133652
20720
15278
130888
88032
120605
84692
92348
21236
20748
130457
3197
69993
128928
59981
36776
69503
1279
89825
91368
47531
3675
76927
56202
43703
16131
114136
60059
22359
31334
99928
35347
7606
124198
121784
125517
15437
84931
110366
12931
23808
6998
42135
17365
49092
94886
130615
21166
94465
122404
130992
152317
122503
307
162195
43764
154253
93763
117809
12436
15641
76366
108749
118795
42335
74936
124053
86730
109782
2465
152355
35735
85152
9564
6558
49448
148150
635
9748
93085
1875
53799
146077
13980
45250
121063
115515
12999
106121
121305
116335
126616
104167
45724
82810
146230
139632
162197
111266
127698
12811
60424
127341
71623
100657
162058
79718
89678
148747
94277
90642
26007
121326
87242
47050
1594
134375
43372
117231
18115
12701
137123
45721
7503
134327
55174
37071
9526
1856
95536
25264
43721
10746
109505
96825
145576
19219
120219
28959
156750
